app/views/profiles/_story_by.html.erb


          <% talephoto = Talephoto.where(tale_id: tale.id) %>
---
SELECT "talephotos".* FROM "talephotos"  WHERE "talephotos"."tale_id" = 342