app/views/tales/_header.html.erb

SELECT "plots"."user_id" FROM "plots"  WHERE "plots"."tale_id" = 343  ORDER BY tale_id DESC
---

<% contributors =  Plot.where(tale_id: @tale.id).pluck(:user_id).uniq.count %>