app/views/tales/_navbar.html.erb


  <% journals = Journal.where(notification_to: current_user.id).last(4) %>
---
SELECT  "journals".* FROM "journals"  WHERE "journals"."notification_to" = 9  ORDER BY "journals"."id" DESC LIMIT 4

  <% journals.reverse.each do|j| %>
    <% tale = Tale.where(id: j.notification_id) %>
---
SELECT  "tales".* FROM "tales"  WHERE "tales"."id" = $1 LIMIT 1  [["id", 343]]

  <%if j.notification_type == "StoryCreate" %>
    <% author = Tale.where(id: j.notification_id).pluck(:user_id) %>
    <% authorName = User.where(id: author[0]).pluck(:firstname) %>
---
SELECT "tales"."user_id" FROM "tales"  WHERE "tales"."id" = 343
SELECT "users"."firstname" FROM "users"  WHERE "users"."id" = 9