app/views/tales/_plot_update.html.erb

 <% plots = Plot.where(tale_id: @tale.id).order(:id) %>
---
SELECT "plots".* FROM "plots"  WHERE "plots"."tale_id" = 343  ORDER BY tale_id DESC, "plots"."id" ASC


      <% plotphoto = Plotphoto.where(plot_id: p.id).order(:created_at) %>
---
SELECT "plotphotos".* FROM "plotphotos"  WHERE "plotphotos"."plot_id" = 605  ORDER BY "plotphotos"."created_at" ASC