app/controllers/bios_controller.rb

  def index
    @bios = Bio.all
---
SELECT "bios".* FROM "bios"

def update
  if current_user.id== @bio.user_id
    respond_to do |format|
        if @bio.update(bio_params)
            main_bio = Bio.where(id: @bio.id)
---
UPDATE "bios" SET "title" = $1, "updated_at" = $2 WHERE "bios"."id" = 145  [["title", "I am the guy who wrote Ryte Club."], ["updated_at", "2015-06-22 17:54:40.973076"]]
SELECT  "bios".* FROM "bios"  WHERE "bios"."id" = $1 LIMIT 1  [["id", 145]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 9  ORDER BY "users"."id" ASC LIMIT 1