app/controllers/plots_controller.rb

INSERT INTO "plots" ("created_at", "description", "tale_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-06-22 17:59:58.626305"], ["description", "<p>Regardi</p>\n"], ["tale_id", 343], ["updated_at", "2015-06-22 17:59:58.626305"]]
SELECT "tales"."user_id" FROM "tales"  WHERE "tales"."id" = 343
---
  def create
    @plot = Plot.new(plot_params)
    respond_to do |format|

    notification = 1

      if @plot.save


        if @plot.user_id != current_user.id     # prevention of identity theft
            @plot.user_id = current_user.id
            @plot.save
        end
        @tale_author_id = Tale.where(id: @plot.tale_id).pluck(:user_id)

UPDATE "plots" SET "description" = $1, "updated_at" = $2 WHERE "plots"."id" = 605  [["description", "<p>Regarding linux,&nbsp;</p>\n"], ["updated_at", "2015-06-22 18:00:01.625837"]]
---
  def update



    respond_to do |format|



    if @plot.user_id == current_user.id

      if @plot.update(plot_params)

SELECT COUNT(*) FROM "plots"  WHERE "plots"."tale_id" = 343 AND (created_at > '2015-06-19 17:59:58.664238')
SELECT COUNT(*) FROM "follows"  WHERE "follows"."followable_type" = 'Tale' AND (created_at > '2015-06-19 17:59:58.660193')
SELECT COUNT(*) FROM "likes"  WHERE "likes"."likeable_type" = 'Tale' AND (created_at > '2015-06-19 17:59:58.662269')
SELECT  "plots".* FROM "plots"  WHERE "plots"."id" = $1  ORDER BY tale_id DESC LIMIT 1  [["id", 605]]
SELECT  "tales".* FROM "tales"  WHERE "tales"."id" = $1 LIMIT 1  [["id", 343]]
---
  def set_trending_data
      numberOfLikes =  Tale.find(@plot.tale_id).likers(User).count
      numberOfFollow = Tale.find(@plot.tale_id).followers(User).count
      numberOfExtension = Plot.where(tale_id: @plot.tale_id).count


      numberOfFollowRecent = Follow.where(followable_type: Tale)
      numberOfFollowRecent = numberOfFollowRecent.where('created_at > ?', 3.days.ago).count

      numberOfLikesRecent = Like.where(likeable_type: Tale)
      numberOfLikesRecent = numberOfLikesRecent.where('created_at > ?', 3.days.ago).count

      numberOfExtensionRecent = Plot.where(tale_id: @plot.tale_id)
      numberOfExtensionRecent = numberOfExtensionRecent.where('created_at > ?', 3.days.ago).count


      Rails.logger.info numberOfFollowRecent
      Rails.logger.info numberOfLikesRecent
      Rails.logger.info numberOfExtensionRecent

      totalTrendingFactor = numberOfLikesRecent+(numberOfFollowRecent*2)+(numberOfExtensionRecent*3)
     Rails.logger.info totalTrendingFactor
      t = Tale.where(id: @plot.tale_id)