app/controllers/plotphotos_controller.rb

  def create
    @plotphoto = Plotphoto.new(plotphoto_params)
    flash[:notice] = 'Plotphoto was successfully created.' if @plotphoto.save
---
INSERT INTO "plotphotos" ("created_at", "image", "plot_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-06-22 18:00:27.350787"], ["image", "Photo_on_5-27-15_at_8.51_PM.jpg"], ["plot_id", 605], ["updated_at", "2015-06-22 18:00:27.350787"]]

    def set_plotphoto
      @plotphoto = Plotphoto.find(params[:id])
---
SELECT  "plotphotos".* FROM "plotphotos"  WHERE "plotphotos"."id" = $1 LIMIT 1  [["id", 279]]