app/controllers/profiles_controller.rb

SELECT "users"."firstname" FROM "users"  WHERE "users"."id" = 9
SELECT "follows"."follower_id" FROM "follows"  WHERE "follows"."followable_type" = 'User' AND "follows"."followable_id" = 9
SELECT "follows"."followable_id" FROM "follows"  WHERE "follows"."follower_type" = 'User' AND "follows"."follower_id" = 9 AND "follows"."followable_type" = 'User'
SELECT COUNT(*) FROM "follows"  WHERE "follows"."followable_type" = 'User' AND "follows"."followable_id" = 9
SELECT COUNT(*) FROM "follows"  WHERE "follows"."follower_type" = 'User' AND "follows"."follower_id" = 9 AND "follows"."followable_type" = 'User'
SELECT "tales".* FROM "tales"  WHERE "tales"."user_id" = 9  ORDER BY "tales"."updated_at" ASC
SELECT "tales".* FROM "tales"  WHERE "tales"."user_id" = 9 AND "tales"."private_flag" = 0  ORDER BY "tales"."updated_at" ASC
SELECT COUNT(*) FROM "tales"  WHERE "tales"."user_id" = 9
---
  def index
    @userFirstName = User.where(id: params[:format]).pluck(:firstname)
    @followers = Follow.where(followable_type: User, followable_id: params[:format]).pluck(:follower_id)
    @followings = Follow.where(follower_type: User, follower_id: params[:format],followable_type: User).pluck(:followable_id)
    @numberOfFollowers = Follow.where(followable_type: User, followable_id: params[:format]).count
    @numberOfFollowings = Follow.where(follower_type: User, follower_id: params[:format],followable_type: User).count
    @idOfStoriesFollowedByMe = Follow.where(follower_type: User, follower_id: params[:format],followable_type: Tale).pluck(:followable_id)
    @numberOfFollowingsTale = Follow.where(follower_type: User, follower_id: params[:format],followable_type: Tale).count
    @bio = Bio.where(user_id: params[:format])

    @story_by_me = Tale.where(user_id: params[:format]).order(:updated_at).reverse
    @published_story_by_me = Tale.where(user_id: params[:format], private_flag: 0).order(:updated_at).reverse
    @number_of_stories_created_by_me = Tale.where(user_id: params[:format]).count