app/controllers/tales_controller.rb

  def index
    #@current_tales = Tale.includes(:plots, :genres).not_featured.recent.filter(params[:filter])
    #@featured_tales = Tale.includes(:plots, :genres).filter(params[:filter]).featured

    #@current_tales = Tale.where(private_flag: 0).order('trending_factor').first(6)
    @current_tales = Tale.where(private_flag: 0, featured: true).first(6)
---
SELECT  "tales".* FROM "tales"  WHERE "tales"."private_flag" = 0 AND "tales"."featured" = 't'  ORDER BY "tales"."id" ASC LIMIT 6

  def show

    @contributors =  Tale.contributors(@tale.id)
    @tale_id = @tale.id
    @authors =  Tale.where(id: @tale.id).pluck(:user_id)
    @followCount = Tale.find(@tale.id).followers(User).count
    @likeCount = Tale.find(@tale.id).likers(User).count
    @authorName = User.where(id: @authors[0]).pluck(:firstname)
    @titles =  Tale.where(id: @tale.id).pluck(:title)
    @talecover = Talephoto.where(tale_id: @tale.id)
    @subheadings = Tale.where(id: @tale.id).pluck(:subheading)
---
SELECT "tales"."user_id" FROM "tales"  WHERE "tales"."id" = 343
SELECT "users"."firstname" FROM "users"  WHERE "users"."id" = 9
SELECT "tales"."title" FROM "tales"  WHERE "tales"."id" = 343
SELECT "talephotos".* FROM "talephotos"  WHERE "talephotos"."tale_id" = 343
SELECT "tales"."subheading" FROM "tales"  WHERE "tales"."id" = 343

  def create
    @tale = Tale.new(tale_params)

    respond_to do |format|
      if @tale.save
          #    @tale.create_activity :create, owner: current_user
          # prevention of identity theft
          @tale.user_id = current_user.id
          @tale.save
          taleId = @tale.id.to_s


          #create notification
          Rails.logger.info("heelo Nishat Raihana");
          followers = Follow.where( followable_type: User, followable_id: current_user.id).pluck(:follower_id)
---
INSERT INTO "tales" ("created_at", "private_flag", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-06-22 17:59:23.800807"], ["private_flag", 1], ["title", "M"], ["updated_at", "2015-06-22 17:59:23.800807"], ["user_id", 9]]
SELECT "follows"."follower_id" FROM "follows"  WHERE "follows"."followable_type" = 'User' AND "follows"."followable_id" = 9

  def update
    respond_to do |format|

      if @tale.update(tale_params)#
---
UPDATE "tales" SET "subheading" = $1, "updated_at" = $2 WHERE "tales"."id" = 343  [["subheading", "T"], ["updated_at", "2015-06-22 17:59:33.493239"]]

  def destroy


     #remove notification
     #remove plots


    if current_user.id==@tale.user_id
    notifications = Journal.where(notification_type: "StoryCreate", notification_id: @tale.id)
    notifications.each do|notification|
      notification.delete
    end


    @tale.destroy
---
SELECT "journals".* FROM "journals"  WHERE "journals"."notification_type" = 'StoryCreate' AND "journals"."notification_id" = 342
DELETE FROM "tales" WHERE "tales"."id" = $1  [["id", 342]]

  def set_trending_data
      numberOfLikes =  Tale.find(@tale.id).likers(User).count
      numberOfFollow = Tale.find(@tale.id).followers(User).count
      numberOfExtension = Plot.where(tale_id: @tale.id).count


      numberOfFollowRecent = Follow.where(followable_type: Tale)
      numberOfFollowRecent = numberOfFollowRecent.where('created_at > ?', 3.days.ago).count

      numberOfLikesRecent = Like.where(likeable_type: Tale)
      numberOfLikesRecent = numberOfLikesRecent.where('created_at > ?', 3.days.ago).count

      numberOfExtensionRecent = Plot.where(tale_id: @tale.id)
      numberOfExtensionRecent = numberOfExtensionRecent.where('created_at > ?', 3.days.ago).count



      totalTrendingFactor = numberOfLikesRecent+(numberOfFollowRecent*2)+(numberOfExtensionRecent*3)

      t = Tale.where(id: @tale.id)
---
SELECT COUNT(*) FROM "plots"  WHERE "plots"."tale_id" = 343 AND (created_at > '2015-06-19 17:59:23.875883')
SELECT "follows".* FROM "follows"  WHERE "follows"."followable_type" = 'Tale' AND "follows"."followable_id" = 342
SELECT COUNT(*) FROM "follows"  WHERE "follows"."followable_type" = 'Tale' AND (created_at > '2015-06-19 17:59:23.868462')
SELECT "likes".* FROM "likes"  WHERE "likes"."likeable_type" = 'Plot' AND "likes"."likeable_id" = 604
SELECT COUNT(*) FROM "likes"  WHERE "likes"."likeable_type" = 'Tale' AND (created_at > '2015-06-19 17:59:23.873561')
SELECT "plots".* FROM "plots"  WHERE "plots"."tale_id" = $1  ORDER BY tale_id DESC  [["tale_id", 342]]
SELECT  "tales".* FROM "tales"  WHERE "tales"."id" = $1 LIMIT 1  [["id", 343]]